/*

	변수 : 데이터 1개 저장할수 있는 공간/메모리/상자
		변수 선언 : let 변수명 = 데이터
	상수 : 데이터 1개 저장할수 있는 공간/메모리/상자
		상수 선언 : const 상수명 = 데이터
	배열 : 데이터 여러개를 한곳에 저장할수 있는 공간/메모리/상자		
		- 순서대로 번호가 붙인 데이터들의 연속적인 형태
		- 순서대로 번호 = '인덱스' **
		- 인덱스 순으로 데이터들을 연속적으로 저장
		1. 배열 : [ 대괄호 사용 ]
		2. 식별번호 : 인덱스사용 [ 0번 시작 ~ ]
		3. 배열 선언
			let 배열명 = [데이터1, 데이터2, 데이터3]
			const 배열명 = [데이터1, 데이터2, 데이터3]
			ex)
			let 청소부 = '하하'
			'청소부'라는 변수명에 1명/개 데이터를 저장했다.
			let 무궁화반 = ['유재석', '강호동', '신동엽', '서장훈']
			'무궁화반'이라는 변수명에 4명/개 데이터를 저장했다.
*/
