package java1.day08;

public class Ex1_객체 {

}
/*
	객체지향프로그래밍 : OOP
	 	- 부품을 먼저 만들고 그 부품들을 하나씩 조립해서 완성품을 만드는 작업
	 	- 객체를 먼저 각각 만들고 서로다른 그 객체들을 하나씩 조립/ 합쳐서 하나의 프로그램을 만드는 작업
	 	- Ex1) 블럭1개 = 객체1개 		=> 블럭여러개 = 레고 완성품
	 	
	객체란 : 물리적으로 존재하거나 개념적으로 존재하는것 중 식별 가능한것
 			- 물리적인 존재 : 자동차, 자전거, 책, 사람 = 손에 잡히는 형태
 			- 개념적인 존재 : 학과, 강의, 주문 = 손에 안잡히는 형태
 			
 		- 속성/필드 과 동작/메소드/행동
 			속성/필드/상태 : 이름 , 나이 , 색깔 , 속도
 			동작/메소드/행동 : 웃다, 먹다, 달린다, 멈춘다
 		
 		- 객체 모델링 : 현실 세계의 객체를 컴퓨터로 옮기는 과정[ 필드/메소드 만드는 과정 ]
 		
	객체의 상호작용
	
		사람객체
			이름 : 강호동
			행동 : 먹는다
			
		사람객체
			이름 : 유재석
			행동 : 먹는다
			
		- 서로 다른 객체들은 메소드/함수 통해 서로 데이터를 주고 받는다.
		
 		
 
 */